/**
 * Created by Gatsjy on 2021-02-12
 * Blog : https://blog.naver.com/gkswndks123
 * Github : https://github.com/gatsjy
 */
public class CellPhone {
    // 7.1 상속개념
    // 현실에서 상속은 부모가 자식에게 물려주는 행위를 말한다. 자식은 상속을 통해서 부모가 불려준 것을 자연스럽게 이용할 수 있다.
    // 객체 지향 프로그램에서도 부모 클래스의 멤버를 자식 클래스에게 물려줄 수 있다.
    // 프로그램에서 부모 클래스를 상위 클래스라고 부르기도 하고, 자식 클래스를 하위 클래스, 또는 파생 클래스라고 부른다.
    // 상속을 해도 부모 클래스의 모든 필드와 메소드들을 물려받는 것은 아니다. 부모 클래스에서 private 접근 제한을 갖는 필드와 메소드는 상속 대상에서 제외된다.
    // 그리고 부모 클래스와 자식 클래스가 다른 채키지에 존재한다면 default 접근 제한을 갖는 필드와 메소드도 상속 대상에서 제외 된다.
    // 상속을 이용하면 클래스의 수정을 최소화시킬 수도 있다. 부모 클래스의 수정으로 모든 자식 클래스들의 수정 효과를 가져오기 때문에 유지보수 시간을 최소화시켜준다.

    // 7.2 클래스 상속

}
